app/controllers/posts_controller.rb

	def create
    @author = Author.first
	  @post = Post.create(post_params)

    @post.author_id = @author.id

	  @post.save
---
SELECT  "authors".* FROM "authors" ORDER BY "authors"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2015-12-31 19:45:52.559860"], ["updated_at", "2015-12-31 19:45:52.559860"]]
UPDATE "posts" SET "updated_at" = ?, "author_id" = ? WHERE "posts"."id" = ?  [["updated_at", "2019-09-28 16:44:57.638231"], ["author_id", 1], ["id", 2]]